BACKEND/codeigniter/app/Models/UsuariosModel.php

SELECT *
FROM `usuarios`
WHERE `status` = '1'
---
    function obtenerUsuarios(){
       return $this->where('status', '1')->findAll(); // Consulta utilizando Query Builder